<details>
  <summary>
    Output of plan:
  </summary>
  <pre>Acquiring state lock. This may take a few moments...
module.postgres.random_password.boundary: Refreshing state... [id=none]
module.cloudflare.data.cloudflare_zone.dsb_dev: Reading...
module.boundary.random_password.david: Refreshing state... [id=none]
module.consul.consul_key_prefix.minio: Refreshing state... [id=homad/minio/]
module.tailscale.data.tailscale_device.nas: Reading...
module.minio.minio_s3_bucket.postgres_backups: Refreshing state... [id=postgres-backups]
module.postgres.random_password.home_assistant: Refreshing state... [id=none]
module.grafana.grafana_dashboard.postgresql: Refreshing state... [id=000000039]
module.grafana.grafana_dashboard.minio: Refreshing state... [id=TgmJnqnnk]
module.grafana.grafana_dashboard.pihole: Refreshing state... [id=PI-Hole-Exporter]
module.grafana.grafana_dashboard.traefik: Refreshing state... [id=O23g2BeWk]
module.grafana.grafana_dashboard.nodes: Refreshing state... [id=rYdddlPWk]
module.cloudflare.data.cloudflare_zone.dsb_dev: Read complete after 0s [id=20b0e70bfdf2afacf4abb84547deea0a]
module.grafana.grafana_data_source.prometheus: Refreshing state... [id=1]
module.tailscale.data.tailscale_device.nas: Read complete after 1s [id=33069324248152329]
module.consul.consul_key_prefix.prometheus: Refreshing state... [id=homad/prometheus/]
module.consul.consul_key_prefix.speed_dial: Refreshing state... [id=homad/speed-dial/]
module.consul.consul_key_prefix.traefik: Refreshing state... [id=homad/traefik/]
module.consul.consul_key_prefix.home_assistant: Refreshing state... [id=homad/home-assistant/]
module.consul.consul_key_prefix.pihole: Refreshing state... [id=homad/pihole/]
module.consul.consul_key_prefix.postgres: Refreshing state... [id=homad/postgres/]
module.tailscale.data.tailscale_devices.nomad_clients: Reading...
module.tailscale.data.tailscale_devices.nomad_clients: Read complete after 0s [id=b769f43d-d078-a1fc-2174-5d9c883cd6a9]
module.minio.minio_s3_bucket.nomad_backups: Refreshing state... [id=nomad-backups]
module.boundary.boundary_role.global_anon_listing: Refreshing state... [id=r_MMCWw32xYB]
module.boundary.boundary_scope.org: Refreshing state... [id=o_G9SFkwnWQ2]
module.postgres.postgresql_role.boundary: Refreshing state... [id=boundary]
module.nomad.nomad_external_volume.minio: Refreshing state... [id=minio]
module.nomad.nomad_job.nomad_gc: Refreshing state... [id=nomad-gc]
module.nomad.nomad_namespace.security: Refreshing state... [id=security]
module.nomad.nomad_namespace.csi: Refreshing state... [id=csi]
module.nomad.nomad_job.prometheus_exporter_postgres: Refreshing state... [id=prometheus-exporter-postgres]
module.nomad.nomad_job.ubuntu_upgrade: Refreshing state... [id=ubuntu-upgrade]
module.nomad.nomad_namespace.storage: Refreshing state... [id=storage]
module.nomad.nomad_job.grafana: Refreshing state... [id=grafana]
module.nomad.nomad_job.docker_gc: Refreshing state... [id=docker-gc]
module.nomad.nomad_job.home_assistant: Refreshing state... [id=homeassistant]
module.nomad.nomad_job.journalctl_gc: Refreshing state... [id=journalctl-gc]
module.nomad.nomad_job.storage_controller: Refreshing state... [id=storage-controller]
module.nomad.nomad_external_volume.home_assistant: Refreshing state... [id=home-assistant]
module.nomad.nomad_external_volume.grafana: Refreshing state... [id=grafana]
module.nomad.nomad_job.bitwarden: Refreshing state... [id=bitwarden]
module.nomad.nomad_job.prometheus_node_exporter: Refreshing state... [id=prometheus-node-exporter]
module.nomad.nomad_job.minio: Refreshing state... [id=minio]
module.nomad.nomad_namespace.monitoring: Refreshing state... [id=monitoring]
module.nomad.nomad_namespace.maintenance: Refreshing state... [id=maintenance]
module.nomad.nomad_job.pihole: Refreshing state... [id=pihole]
module.nomad.nomad_job.postgres_backup: Refreshing state... [id=postgres-backup]
module.nomad.nomad_job.postgres: Refreshing state... [id=postgres]
module.nomad.nomad_external_volume.postgres: Refreshing state... [id=postgres]
module.nomad.nomad_job.prometheus: Refreshing state... [id=prometheus]
module.nomad.nomad_namespace.apps: Refreshing state... [id=apps]
module.nomad.nomad_job.nomad_config_backup: Refreshing state... [id=nomad-config-backup]
module.nomad.nomad_job.boundary: Refreshing state... [id=boundary]
module.nomad.nomad_job.prometheus_exporter_pihole: Refreshing state... [id=prometheus-exporter-pihole]
module.nomad.nomad_external_volume.bitwarden: Refreshing state... [id=bitwarden]
module.nomad.nomad_job.traefik: Refreshing state... [id=traefik]
module.nomad.nomad_namespace.networking: Refreshing state... [id=networking]
module.nomad.nomad_job.speed_dial: Refreshing state... [id=speed-dial]
module.nomad.nomad_external_volume.prometheus: Refreshing state... [id=prometheus]
module.nomad.nomad_job.storage_node: Refreshing state... [id=storage-node]
module.postgres.postgresql_role.home_assistant: Refreshing state... [id=home_assistant]
module.vault.vault_policy.boundary_reader: Refreshing state... [id=boundary-reader]
module.vault.vault_policy.home_assistant_reader: Refreshing state... [id=home-assistant-reader]
module.vault.vault_policy.postgres_reader: Refreshing state... [id=postgres-reader]
module.vault.vault_policy.minio_reader: Refreshing state... [id=minio-reader]
module.vault.vault_policy.cloudflare_reader: Refreshing state... [id=cloudflare-reader]
module.vault.vault_policy.boundary_credential_store: Refreshing state... [id=boundary-credential-store]
module.vault.vault_policy.pihole_reader: Refreshing state... [id=pihole-reader]
module.vault.vault_policy.grafana_reader: Refreshing state... [id=grafana-reader]
module.vault.vault_generic_secret.home_assistant: Refreshing state... [id=home-assistant/auth]
module.vault.vault_generic_secret.minio: Refreshing state... [id=minio/root]
module.vault.vault_generic_secret.grafana: Refreshing state... [id=grafana/admin]
module.vault.vault_policy.nomad_server: Refreshing state... [id=nomad-server]
module.vault.vault_generic_secret.pihole: Refreshing state... [id=pihole/auth]
module.vault.vault_generic_secret.boundary_config: Refreshing state... [id=boundary/config]
module.vault.vault_generic_secret.cloudflare: Refreshing state... [id=cloudflare/auth]
module.vault.vault_generic_secret.postgres_root: Refreshing state... [id=postgres/root]
module.vault.vault_generic_secret.boundary_password: Refreshing state... [id=boundary/david]
module.boundary.boundary_scope.homad: Refreshing state... [id=p_6zW3UuHzWz]
module.boundary.boundary_auth_method.password: Refreshing state... [id=ampw_Tg5W8LUt8W]
module.boundary.boundary_role.org_anon_listing: Refreshing state... [id=r_Yr8cQSTbbH]
module.cloudflare.cloudflare_record.nas: Refreshing state... [id=c338f901cad2db1b6954823ea44e3011]
module.vault.vault_token.boundary: Refreshing state... [id=71seINq7tJpVw5YhgHb1Fn2C]
module.cloudflare.cloudflare_record.www_nas: Refreshing state... [id=aa607a64c9bc292edb6d073442f7700c]
module.vault.vault_token_auth_backend_role.nomad_cluster: Refreshing state... [id=auth/token/roles/nomad-cluster]
module.cloudflare.cloudflare_record.homelab["100.76.222.102"]: Refreshing state... [id=afa3d9d6b749647230a2d6dd0ce220b7]
module.cloudflare.cloudflare_record.homelab["100.105.214.9"]: Refreshing state... [id=12a1d62c5c16c63fbcc5fbc753be8415]
module.cloudflare.cloudflare_record.homelab["100.88.254.41"]: Refreshing state... [id=ae4fc7483dbfc520f646211783e78ec9]
module.cloudflare.cloudflare_record.homelab["100.99.108.54"]: Refreshing state... [id=1c29e5087369373e0aceef81257ea632]
module.cloudflare.cloudflare_record.homelab_wildcard["100.99.108.54"]: Refreshing state... [id=87ea4d64ca8673c8b001c7b9da2bfe98]
module.cloudflare.cloudflare_record.homelab_wildcard["100.105.214.9"]: Refreshing state... [id=56ff5d6c208899b4690178100fa537af]
module.cloudflare.cloudflare_record.homelab_wildcard["100.76.222.102"]: Refreshing state... [id=b10973dcadec2f217af685046757b4b3]
module.cloudflare.cloudflare_record.homelab_wildcard["100.88.254.41"]: Refreshing state... [id=133e2da9544bbd1826bacd5dad9037d3]
module.cloudflare.cloudflare_record.www_homelab["100.105.214.9"]: Refreshing state... [id=6559a1eed16e3c399ce0f849da097d84]
module.cloudflare.cloudflare_record.www_homelab["100.88.254.41"]: Refreshing state... [id=ff070bb85e8aae96401ce6be67198ca3]
module.cloudflare.cloudflare_record.www_homelab["100.76.222.102"]: Refreshing state... [id=dd3b139c5281fbf3aa8bc3bbcb090f2a]
module.cloudflare.cloudflare_record.www_homelab["100.99.108.54"]: Refreshing state... [id=fcb7f23d1ab66b70a679874e48d6b7b9]
module.boundary.boundary_host_catalog.homelab: Refreshing state... [id=hcst_C1UVKckVmP]
module.boundary.boundary_account.david: Refreshing state... [id=acctpw_F9duP9C5XZ]
module.boundary.boundary_host.homelab["100.76.222.102"]: Refreshing state... [id=hst_Xjx21jXF4N]
module.boundary.boundary_host.homelab["100.99.108.54"]: Refreshing state... [id=hst_Z0xFFtV05d]
module.boundary.boundary_host.homelab["100.88.254.41"]: Refreshing state... [id=hst_TfxFqqUve9]
module.boundary.boundary_host.homelab["100.105.214.9"]: Refreshing state... [id=hst_uAzUE2RDJm]
module.boundary.boundary_credential_store_vault.homad: Refreshing state... [id=csvlt_WCxBCvdT64]
module.postgres.postgresql_database.boundary: Refreshing state... [id=boundary]
module.boundary.boundary_user.david: Refreshing state... [id=u_rO25D7JJ3Z]
module.boundary.boundary_host_set.homelab: Refreshing state... [id=hsst_1S2gXCRZNi]
module.vault.vault_generic_secret.postgres_boundary: Refreshing state... [id=postgres/boundary]
module.boundary.boundary_credential_library_vault.homad: Refreshing state... [id=clvlt_9TZT02M43s]
module.boundary.boundary_role.david_admin: Refreshing state... [id=r_REcU18pNCO]
module.boundary.boundary_role.homad_admin: Refreshing state... [id=r_vNi4xq6USk]
module.postgres.postgresql_database.home_assistant: Refreshing state... [id=home_assistant]
module.vault.vault_generic_secret.postgres_home_assistant: Refreshing state... [id=postgres/home_assistant]
module.boundary.boundary_target.homelab: Refreshing state... [id=ttcp_tjcaV6VG3X]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nomad.nomad_job.postgres_vacuum will be created
  + resource "nomad_job" "postgres_vacuum" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "homad",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "postgres-vacuum" {
              datacenters = ["homad"]
              type        = "batch"
              region      = "global"
              namespace   = "maintenance"
            
              periodic {
                cron             = "@daily"
                prohibit_overlap = true
              }
            
              group "postgres-vacuum" {
                task "vacuum" {
                  driver = "raw_exec"
            
                  config {
                    command = "vacuumdb"
                    args    = ["--all", "--skip-locked", "--full"]
                  }
            
                  vault {
                    policies      = ["postgres-reader"]
                    change_mode   = "signal"
                    change_signal = "SIGUSR1"
                  }
            
                  template {
                    destination = "secrets/postgres.env"
                    env         = true
                    data        = <<EOT
            {{- with secret "postgres/data/root" }}
            PGUSER={{.Data.data.user}}
            PGPASSWORD={{.Data.data.password}}
            PGHOST=postgres.homelab.dsb.dev
            {{ end }}
            EOT
                  }
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "postgres-vacuum"
      + namespace               = "maintenance"
      + region                  = "global"
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "postgres-vacuum"
              + task    = [
                  + {
                      + driver        = "raw_exec"
                      + meta          = (known after apply)
                      + name          = "vacuum"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "batch"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.boundary.boundary_account.david,
  on boundary/accounts.tf line 6, in resource "boundary_account" "david":
   6: resource "boundary_account" "david" {

Deprecated: use `boundary_account_password` instead.

(and 10 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: .plan

To perform exactly these actions, run the following command to apply:
    terraform apply ".plan"
Releasing state lock. This may take a few moments...
</pre>
</details>